{
    "unit": "inversion",
    "subsections": [
        {
            "subsectionName": "inversion",
            "subsectionContent": [
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Powiedz czym jest inwersja stylistyczna oraz kiedy jej używamy.",
                    "guid": "14a9fcdd-fa51-418f-b6d5-8804d3577465"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 1/97 from workbook",
                    "task": "Uzupełnij zdania jednym z podanych słów: little, so, hardly, such, never, only, no sooner, not.",
                    "content": [
                        "... by studying hard can you achieve high scores in a test!",
                        "... only was he late, but he was also unprepared for the lesson.",
                        "... was the heat that we spent the whole day by the swimming pool.",
                        "... have I been so insulted in my entire life!",
                        "... did we realise what was going to happen just a moment later.",
                        "... funny did he look that we couldn't help laughing at him.",
                        "... had we entered the hall than the phone rang.",
                        "... had I started reading the book when my brother told me how it would end."
                    ],
                    "answers": [
                        "only",
                        "not",
                        "such",
                        "never",
                        "little",
                        "so",
                        "no sooner",
                        "hardly"
                    ],
                    "guid": "0583e4cd-1904-4cae-8fdc-a27c62ff006c"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 2/97 from workbook",
                    "task": "Uzupełnij zdania właściwą formą wyrazów podanych w nawiasach.",
                    "content": [
                        "It was a crazy day yesterday. Hardly ... (we / enter) the school when the fire drill ... (start).",
                        "Only by using the Internet ... (you / be / able) to access unlimited resources from all over the world.",
                        "I can't believe he was so rude to us. Not only ... (he / make) us wait for over half an hour but ... (he also / not want) to listen to us!",
                        "This is a great crime story, indeed! Never before ... (I / have) so much fun reading about detectives!",
                        "Rarely ... (writers / publish) three bestsellers in a row.",
                        "Not until ... (the police / phone) us ... (we / find) out that he'd been kidnapped.",
                        "They must have been watching her house. No sooner ... (she / leave) home than ... (they / try) to break in.",
                        "Only after reading the first chapter ... (I / realise) that I had read the novel before.",
                        "So scary ... (the novel / be) that I couldn't fall asleep after reading it.",
                        "his love story is truly unique. In fact, rarely ... (a romance / make) such a difference to the way I feel. "
                    ],
                    "answers": [
                        "had we entered, started",
                        "are you able",
                        "did he make, he also didn't want",
                        "have I had",
                        "do writers publish",
                        "the police phoned, did we find",
                        "had she left, they tried",
                        "did I realise",
                        "was the novel",
                        "does a romance make"
                    ],
                    "guid": "e257088a-829f-44d2-9e40-d6ff17366ef4"
                },
                {
                    "type": "exercise",
                    "source": "Wielka gramatyka języka angielskiego (edgard); ex. 39 p. 373",
                    "task": "Uzupełnij zdania właściwą formą wyrazów podanych w nawiasach.",
                    "content": [
                        "Only when I returned home, (I, notice) ____________________ I had left my phone at work.",
                        "Rarely (it, happen) ____________________ that a woman proposes to a man.",
                        "No sooner (the book, publish) ____________________ than it became a bestseller.",
                        "Should (you, speak) ____________________ to Ms Brown, please tell her to come to my office.",
                        "Under no circumstances (be, you, lend) ____________________ money to Jerry.",
                        "Not only (I, be) ____________________ late for work but I also lost my wallet.",
                        "Only after he spoke to his boss (he, decide) ____________________ to stay on at his old job.",
                        "Not until I had got on the bus (I, realize) ____________________ my ticket was invalid."
                    ],
                    "answers": [
                        "did I notice",
                        "does it happen",
                        "had the book been published",
                        "you speak",
                        "are you to lend",
                        "was I",
                        "did he decide",
                        "did I realize"
                    ],
                    "guid": "3bfda5ef-c3cd-4ff9-bd05-af3bcb03120c"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 3/98 from workbook",
                    "task": "Przepisz zdania zaczynając od podanych słów.",
                    "content": [
                        "He is a good journalist and he also writes beautiful poetry.\nNot only ... .",
                        "We didn't know much about his personal problems.\nLittle ... .",
                        "It's the most foolish story I've ever heard!\nNever ... .",
                        "As soon as I lay down on the sofa there was a knock on the door.\nNo sooner ... .",
                        "The moment I started the second chapter, it came to my mind who the killer was.\nBarely ... .",
                        "It was such a difficult problem that no one could solve it.\nSuch ... .",
                        "He seldom sees his family.\nSeldom ... .",
                        "Until you get to know him better, you won't understand him.\nOnly after ... .",
                        "Immediately after everyone had left the building, the bomb went off.\nHardly ... .",
                        "The water was so cold that no one went for a swim.\nSo ... ."
                    ],
                    "answers": [
                        "Not only is he a good journalist, but he also writes beautiful poetry.",
                        "Little did we know about his personal problems.",
                        "Never have I heard a more foolish story.",
                        "No sooner had I lain down on the sofa than there was a knock on the door. ",
                        "Barely had I started the second chapter when it came to my mind who the killer was.",
                        "Such a difficult problem was it that no one could solve it.",
                        "Seldom does he see his family.",
                        "Only after you get to know him better will you understand him.",
                        "Hardly had everyone left the building when the bomb went off.",
                        "So cold was the water that no one went for a swim. "
                    ],
                    "guid": "30664e4b-4dbe-41ff-8bf4-9812b28841fd"
                },
                {
                    "type": "exercise",
                    "source": "Wielka gramatyka języka angielskiego (edgard); ex. 38 p. 373",
                    "task": "Przepisz zdania zaczynając od podanych słów i uzupełnij formą czasowników.",
                    "content": [
                        "The discussion was so vivid that we couldn’t calm down.\nSo ... .",
                        "The tension was so great that nobody said a word.\nSuch ... .",
                        "I have seldom heard such kind words.\nSeldom ... .",
                        "As soon as I entered the room, I noticed there had been a burglary.\nNo sooner ... .",
                        "The country was in a crisis, not only a financial one, but also a political one.\nNot only ... .",
                        "You can’t show these documents to anybody no matter what.\nUnder no circumstances ... .",
                        "If we had known about his past, we wouldn’t have hired him.\nHad ... .",
                        "The police knew little about the scope of that fishy business.\nLittle ... ."
                    ],
                    "answers": [
                        "So vivid was the discussion that we couldn’t calm down.",
                        "Such was the tension that nobody said a word.",
                        "Seldom have I heard such kind words.",
                        "No sooner had I entered the room than I noticed there had been a burglary.",
                        "Not only was the country in a financial crisis, but also a political one.",
                        "Under no circumstances can you show these documents to anybody.",
                        "Had we known about his past, we wouldn’t have hired him.",
                        "Little did the police know about the scope of that fishy business."
                    ],
                    "guid": "4b4b6c5f-fbef-416e-9a85-a1aa178fabe2"
                },
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Przetłumacz zdania na angielski, stosując inwersję.",
                    "content": [
                        "Nigdy wcześniej nie widziałem tak pięknego widoku.",
                        "Pod żadnym pozorem nie wolno ci otwierać tego pudełka.",
                        "Nie tylko znał odpowiedź, ale także potrafił ją wyjaśnić.",
                        "Rzadko kiedy widuje się tak utalentowanego artystę.",
                        "Dopiero gdy wyszła, zdał sobie sprawę, jak bardzo ją kocha.",
                        "Tylko kiedy stracił pracę, zrozumiał, jak bardzo jej potrzebował.",
                        "Mało kto wie o jej sekretnym hobby.",
                        "Pod żadnym pozorem nie wolno ci zdradzać tego sekretu.",
                        "Rzadko kiedy spotykam kogoś tak miłego.",
                        "Nie wcześniej niż po godzinie skończyliśmy projekt."
                    ],
                    "answers": [
                        "Never before had I seen such a beautiful view.",
                        "Under no circumstances are you allowed to open this box.",
                        "Not only did he know the answer, but he could also explain it.",
                        "Rarely do you see such a talented artist.",
                        "Only when she left did he realize how much he loved her.",
                        "Only when he lost his job did he understand how much he needed it.",
                        "Little does anyone know about her secret hobby.",
                        "Under no circumstances must you reveal this secret.",
                        "Seldom do I meet someone so kind.",
                        "Not until an hour later did we finish the project."
                    ],
                    "guid": "6c12ffc6-c1e5-4ccd-bd91-b91602f77a94"
                }
            ]
        }
    ]
}