{
    "unit": "relative-clauses",
    "subsections": [
        {
            "subsectionName": "relative-clauses",
            "subsectionContent": [
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Powiedz czym są zdania przydawkowe, a następnie opisz ich rodzaje.",
                    "uuid": "6197ad66-2493-40ae-ae3a-3326bdbf94f3"
                },
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Uzupełnij zdania odpowiednim zaimkiem who, which, whose, when, where.",
                    "content": [
                        "The boy … is standing at the door is my boyfriend.",
                        "The documents … are on your desk were delivered this morning.",
                        "My sister Kate, … studies English, has an Irish boyfriend.",
                        "Barcelona is the city … the Olympic Games were held in 1992.",
                        "I love the dress … you bought in France.",
                        "The boy … dog went missing couldn't stop crying.",
                        "Do you know the girl … is dancing with Mark?",
                        "Easter Sunday is a time … many people go to church.",
                        "That's the boy … brother is a famous musician.",
                        "Paris is the place … I want to go next year.",
                        "Are these the books … you were looking for?",
                        "Please describe the place … you last saw Mr Jones.",
                        "Jane, … sister is a doctor, wants to become a nurse.",
                        "A firefighter is someone … stops fires from burning.",
                        "My mother is the person … I trust the most."
                    ],
                    "answers": [
                        "who",
                        "which",
                        "who",
                        "where",
                        "which",
                        "whose",
                        "who",
                        "when",
                        "whose",
                        "where",
                        "which",
                        "where",
                        "whose",
                        "who",
                        "who"
                    ],
                    "uuid": "388c1fb3-24af-45b9-93f9-d5789e1266e8"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 1/56 from workbook",
                    "task": "Wybierz poprawne uzupełnienie zdania. Czasem więcej niż jedna opcja jest poprawna.",
                    "content": [
                        "Sharon, I need the book (that / which / -) I lent you a couple of weeks ago. A friend of mine (- / whom / that) is preparing for an exam needs to borrow it.",
                        "We spoke to several people (that / which / who) had applied for the job.",
                        "We looked at the flats (which / where / -) you recommended, but none of them were suitable.",
                        "The room (when / which / where) I slept was very gloomy.",
                        "Tom's first job, (that / which / -) required a lot of travelling, was very tiring.",
                        "Is there anyone in our class (who / that / whose) parents would like to help prepare the party?",
                        "Do you know of a place (that / where / which) we can talk without being disturbed all the time?",
                        "2010 was the year (that / - / when) I started my career in fashion design.",
                        "What's the name of the girl (that / - / whom) you asked so many questions at the meeting?",
                        "Carol Green is the teacher (whose / who / that) will be taking over maths classes next year. "
                    ],
                    "answers": [
                        "that/which/-, that",
                        "that/who",
                        "which/-",
                        "where",
                        "which",
                        "whose",
                        "where",
                        "that/-/when",
                        "that/-/whom",
                        "who/that"
                    ],
                    "uuid": "d3ff1072-d6a2-4766-b974-900a2a9e9600"
                },
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Połącz dwa zdania w jedno, zwrócić uwagę na prawidłowe użycie przecinków.",
                    "content": [
                        "Coca-Cola is a brand name. Everyone knows it.",
                        "My mother works with children. They have cancer.",
                        "My mother is a doctor. Her name is Maria.",
                        "I love films. They have happy endings.",
                        "My computer is brand new. It cost $3,000.",
                        "This is a nurse. She helped save my baby brother.",
                        "Orange is my favourite colour. You get it from red and yellow.",
                        "Mark was late for school yesterday. He is usually on time.",
                        "I went to the library. I met Dave there.",
                        "We saw a film. I liked it a lot."
                    ],
                    "answers": [
                        "Coca-Cola is a brand which/that everyone knows. LUB Coca-Cola, which everyone knows, is a brand.",
                        "My mother works with children who/that have cancer.",
                        "My mother, whose name is Maria, is a doctor.",
                        "I love films which/that have happy endings.",
                        "My computer, which cost $3,000, is brand new. LUB My computer, which is brand new, cost $3,000.",
                        "This is a nurse who/that helped save my baby brother.",
                        "Orange, which you get from red and yellow, is my favourite colour.",
                        "Mark, who is usually on time, was late for school yesterday.",
                        "I went to the library where I met Dave.",
                        "We saw a film which/that I liked a lot."
                    ],
                    "uuid": "2014713c-31c4-47b4-ad64-1507f0c31050"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 5/70 from student's book",
                    "task": "Połącz dwa zdania w jedno, zwrócić uwagę na prawidłowe użycie przecinków.",
                    "content": [
                        "The professor is a great inspiration to me. We saw her presentation.",
                        "This is the primary school. I met many of my friends there.",
                        "James is the friend from high school. I studied at his house all the time.",
                        "The case has now been solved. We discussed it yesterday.",
                        "Tom Smith is now a well-known expert. His books are best-sellers.",
                        "Steve used to work in the bank. He is now a teacher.",
                        "This is the sports centre. I learned martial arts skills here.",
                        "This is the book. I said I would give it to you.",
                        "Ivy's house is nearly finished. It was designed by a great architect. ",
                        "This is our new teacher. I told you about her last week. "
                    ],
                    "answers": [
                        "The professor hose presentation we saw is a great inspiration to me.",
                        "This is the primary school where I met many of my friends.",
                        "James is the friend from high school whose house I studied at/at hose house I studied at all time.",
                        "The case (which/that) we discussed yesterday has now been solved.",
                        "Tom Smith, whose books are best-sellers, is now a well-known expert.",
                        "Steve, who is now a teacher, used to work in the bank.",
                        "This is the sports centre where I learned martial art skills.",
                        "This is the book (which/that) I said I would give to you.",
                        "Ivy's house, which was designed by a grwat architect, is nearly finished.",
                        "This is our new teacher (who/that/whom) I told you about last week."
                    ],
                    "uuid": "aaaeabfa-6071-44b1-98e7-a918ec5619e1"
                },
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Przetłumacz zdania.",
                    "content": [
                        "To jest miejsce, gdzie się poznaliśmy.",
                        "Nauczyciel to osoba, która uczy ludzi.",
                        "Mój biały płaszcz, który kupiłam w zeszłym roku, jest na mnie za mały.",
                        "Moja szefowa, która jest bardzo miła, mieszka w Londynie.",
                        "W ubiegłym roku odwiedziłem miasto, w którym się urodziłem."
                    ],
                    "answers": [
                        "This is the place where we met.",
                        "A teacher is a person who teaches people.",
                        "My white coat, which I bought last year, is too small for me.",
                        "My boss, who is very nice, lives in London.",
                        "Last year I visited the town where I was born."
                    ],
                    "uuid": "6e28cc67-db17-4156-9231-393bd4cd5bd9"
                }
            ]
        },
        {
            "subsectionName": "reduced-relative-clauses",
            "subsectionContent": [
                {
                    "type": "exercise",
                    "source": "Own tasks",
                    "task": "Powiedz czym są tzw. reduced relative clauses oraz kiedy ich używamy.",
                    "uuid": "868cc350-cd19-4a5c-9db0-565ce093fcb3"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 1/57 from workbook",
                    "task": "Wybierz poprawne uzupełnienie zdania.",
                    "content": [
                        "All the students (waiting/waited) for the exam results were very nervous.",
                        "The student council elections, (organising/organised) last month, will have to be held again.",
                        "I believe that every student, (giving/given) enough time, will be able to do this task.",
                        "Margaret, (bounced/bouncing) back after failing the exam, is back in a party mood.",
                        "The young journalist, (conducting/conducted) an interview with the courageous teenager, actually seemed rather indifferent.",
                        "Oh, no! The local gym, (offering/offered) discounts for students, is going to close down."
                    ],
                    "answers": [
                        "waiting",
                        "organised",
                        "given",
                        "bouncing",
                        "conducting",
                        "offering"
                    ],
                    "uuid": "16ad30d7-6c7c-47be-9adc-0801f35b1dde"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 2/58 from workbook",
                    "task": "Uzupełnij zdania właściwą formą czasowników podanych w nawiasach. Użyj reduced relative clauses.",
                    "content": [
                        "Can you see the man ... (wave) at us? That's my roommate.",
                        "The money ... (collect) at the Charity Bazaar will be used to fund a scholarship for poor kids in our neighbourhood.",
                        "The woman ... (talk) to my wife is the most creative person I know. She writes books for children.",
                        "The thief, ... (arrest) yesterday, left his fingerprints in the house he had burgled.",
                        "All students ... (take part) in the workshops at the job fair were rather pessimistic about their future careers. ",
                        "A black minivan, ... (drive) by a young man, suddenly crashed into a tree."
                    ],
                    "answers": [
                        "waving",
                        "collected",
                        "talking",
                        "arrested",
                        "taking part",
                        "driven"
                    ],
                    "uuid": "6843a4f4-2a65-4054-bba8-d8612c72f11b"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 4/58 from workbook",
                    "task": "Przepisz zdania używając reduced relative clauses. Niektóre zdania nie mogą być skrócone.",
                    "content": [
                        "The blonde woman who is standing by the window is my aunt.",
                        "All of the classmates, whom Margaret has invited to the party, have refused to come.",
                        "The bride was wearing a dress which was ordered from Paris.",
                        "The person who won the lottery last week lives in my town.",
                        "They are now renovating the bridge which connects the two parts of the city.",
                        "Have you had a chance to watch the film which I recommended?"
                    ],
                    "answers": [
                        "The blonde woman STANDING by the window is my aunt.",
                        "x",
                        "The bride was wearing a dress ORDERED from Paris.",
                        "x",
                        "They are now renovating the bridge CONNECTING the two parts of the city.",
                        "x"
                    ],
                    "uuid": "147940d0-9ab2-4b32-aa29-dc6ea9f7e2c4"
                },
                {
                    "type": "exercise",
                    "source": "Password 3 (macmillan); ex. 6/71 from student's book",
                    "task": "Przepisz zdania używając reduced relative clauses. Dwa z tych zdań nie mogą być skrócone.",
                    "content": [
                        "There is a black car which is parked outside with two police officers who are sitting in it.",
                        "Harvard University, which the people of Massachusetts are very proud of, is the oldest in the USA.",
                        "The teacher asked the students who were waiting outside her classroom to make less noise.",
                        "My brother, who is an excellent cricket player, hopes to join a professional team.",
                        "The boy, who had been left alone by his friends, soon began to cry.",
                        "The film script, which was written by the author of the novel, is really brilliant.",
                        "The football club, which several of my friends are involved in, sounds like a lot of fun.",
                        "My best friend Julia, who doesn't have any brothers or sisters, has a large room of her own."
                    ],
                    "answers": [
                        "There is a black car PARKED outside with two police officers SITTING in it.",
                        "x",
                        "The teacher asked the students WAITING outside her classroom to make less noise.",
                        "My brother, BEING an excellent cricket player, hopes to join a professional team.",
                        "The boy, LEFT alone by his friends, soon began to cry.",
                        "The film script, WRITTEN by the author of the novel, is really brilliant.",
                        "x",
                        "My best friend Julia, NOT HAVING any brothers or sisters, has a large room of her own."
                    ],
                    "uuid": "bb38060b-aeee-4bef-83ee-bdebe87983d0"
                }
            ]
        }
    ]
}